language = input("Какой язык программирования ты изучаешь? ")
print(language, " - отличный выбор")

# Правильно (без пробела перед закрывающей скобкой):
print('Follow PEP8!')
# Неправильно:
print ('Follow PEP8!')

# Рекомендация 2. После запятой нужен пробел.

# Правильно:
print('PEP8', 'Rocks!')
# Неправильно:
print('PEP8','Rocks!')

# Рекомендация 3. Не отделяйте пробелами знак «равно», когда он употребляется для обозначения значения
# параметра по умолчанию.

# Правильно:
print('My name', 'is', 'Python', sep='**', end='+')
# Неправильно:
print ('My name', 'is', 'Python', sep = '**', end = '+')/


/aXZWE;3V